#-----------------------------------------------
if True
print('hello')
#-----------------------------------------------
1.3j5
#-----------------------------------------------
def bad_reference():
    print(my_var)
    my_var = 123

bad_reference9()
#-----------------------------------------------
def sometimes_ok(x):
    if x:
        my_var = 123
        print(my_var)

sometimes_ok(True) #123
sometimes_ok(False) #エラーとなる
#-----------------------------------------------
def bad_math():
    return 1/0

bad_math()
#-----------------------------------------------